; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared1 - mode
	thermograph0 - mode
	GroundStation2 - direction
	Star10 - direction
	Star7 - direction
	Star4 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star6 - direction
	Star5 - direction
	GroundStation3 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star7)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation9)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 Star6)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 infrared1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star6)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite1 Star5)
	(pointing satellite3 GroundStation9)
	(have_image Star11 infrared1)
	(have_image Planet12 infrared1)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 infrared1)
	(have_image Star15 infrared1)
	(have_image Phenomenon16 thermograph0)
	(have_image Phenomenon17 thermograph0)
	(have_image Star18 thermograph0)
))

)

; plan
1. (turn_to satellite3 groundstation9 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 groundstation9)
   goals met: 1 of 10
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 10
3. (calibrate satellite2 instrument5 groundstation8)
   added: (calibrated instrument5)
   goals met: 1 of 10
4. (turn_to satellite2 phenomenon17 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 phenomenon17)
   goals met: 1 of 10
5. (take_image satellite2 phenomenon17 instrument5 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 2 of 10
6. (turn_to satellite2 phenomenon16 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon16)
   goals met: 2 of 10
7. (take_image satellite2 phenomenon16 instrument5 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 3 of 10
8. (turn_to satellite2 phenomenon13 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon13)
   goals met: 3 of 10
9. (turn_to satellite1 star5 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 star5)
   goals met: 4 of 10
10. (take_image satellite2 phenomenon13 instrument5 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 5 of 10
11. (turn_to satellite2 planet12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 planet12)
   goals met: 5 of 10
12. (take_image satellite2 planet12 instrument5 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 6 of 10
13. (turn_to satellite2 star11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star11)
   goals met: 6 of 10
14. (take_image satellite2 star11 instrument5 infrared1)
   added: (have_image star11 infrared1)
   goals met: 7 of 10
15. (turn_to satellite2 star14 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star14)
   goals met: 7 of 10
16. (take_image satellite2 star14 instrument5 infrared1)
   added: (have_image star14 infrared1)
   goals met: 8 of 10
17. (turn_to satellite2 star15 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star15)
   goals met: 8 of 10
18. (take_image satellite2 star15 instrument5 infrared1)
   added: (have_image star15 infrared1)
   goals met: 9 of 10
19. (turn_to satellite2 star18 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star18)
   goals met: 9 of 10
20. (take_image satellite2 star18 instrument5 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 10 of 10
